*** 第二步：导出源代码

将下面这段代码中第一行 =cnhl-export-dir= 的值改为你想将 =cnhl= 安装到的位置，之
后在代码块中按下 =C-c C-c= 执行。 =Cnhl= 的源码将导出到你所设置的文件夹下。

在这个过程中 =Cnhl= 会编译 dynamic module ，请确保你的电脑上有 gcc 或其它编译工
具。

#+begin_src emacs-lisp :tangle no
  (defvar cnhl-export-dir "~/.emacs.d/cnhl")

  (setq cnhl-export-path
	(file-name-concat cnhl-export-dir "cnhl.el"))

  (setq cnhl-thulac-export-path
	(file-name-concat cnhl-export-dir "cnhl-thulac.cpp"))

  (org-babel-tangle)

  (cd cnhl-export-dir)

  (async-shell-command
   "git clone --depth 1 https://github.com/thunlp/THULAC.git ./thulac ; g++ -c -I ./thulac/include -std=c++11 cnhl-thulac.cpp ; g++ -shared cnhl-thulac.o -o cnhl-thulac.so ; rm -rf cnhl-thulac.cpp cnhl-thulac.o thulac/"
   "*Cnhl Compile Module*")
#+end_src

#+RESULTS:
: #<window 21 on *Cnhl Compile Module*>

